tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "sschlesier/csvutils"
tap "timescale/tap"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# Print a list of paths as a tree of paths 🌳
brew "as-tree"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Software library to render fonts
brew "freetype"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Emacs dependency management
brew "cask"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# Console Matrix
brew "cmatrix"
# Color-highlighted diff(1) output
brew "colordiff"
# Configurable talking characters in ASCII art
brew "cowsay"
# Cross-platform, efficient and practical CSV/TSV toolkit in Golang
brew "csvtk"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line DNS client
brew "dog"
# Lightning-fast linter for .env files written in Rust
brew "dotenv-linter"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Geometry Engine
brew "geos"
# Cartographic Projections Library
brew "proj"
# Optimized BLAS library
brew "openblas"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU implementation of time utility
brew "gnu-time"
# POSIX-compliant AWK interpreter written in Go
brew "goawk"
# Ping, but with a graph
brew "gping"
# Popular GNU data compression program
brew "gzip"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Conversion library
brew "libiconv"
# Next-gen compiler infrastructure
brew "llvm@9"
# Rainbows and unicorns in your console!
brew "lolcat"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Command-line based markdown presentation tool
brew "mdp"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Netlify command-line tool
brew "netlify-cli"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pandoc filter for numbering and cross-referencing
brew "pandoc-crossref"
# Shell command parallelization utility
brew "parallel"
# Parallel gzip
brew "pigz"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql", restart_service: true
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Modern replacement for ps written by Rust
brew "procs"
# Parse HTML at the command-line
brew "pup"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Static type checker for Python
brew "pyright"
# Software environment for statistical computing
brew "r"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy Finder in rust!
brew "sk"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Simplified and community-driven man pages
brew "tldr"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Unidata unit conversion library
brew "udunits"
# Provide version control info in shell prompts
brew "vcprompt"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Fast CSV toolkit written in Rust
brew "xsv"
# Copy terminal output to clipboard
brew "yank"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Compression and file packaging/archive utility
brew "zip"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Smart and simple CSV processing on the command-line
brew "sschlesier/csvutils/csvquote"
# An open-source time-series database optimized for fast ingest and complex queries. Fully compatible with PostgreSQL.
brew "timescale/tap/timescaledb"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-hack-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
# Monospaced typeface designed for programming in Julia
cask "font-juliamono"
cask "font-lato"
cask "font-montserrat"
cask "font-open-sans"
cask "font-poppins"
# Elegant sans-serif font family, now 9 weights and italic style
cask "font-raleway"
cask "font-roboto-mono"
cask "font-yanone-kaffeesatz"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Programming language for technical computing
cask "julia"
# Keyboard customizer
cask "karabiner-elements"
# File archiver
cask "keka"
# Native app email client for Gmail
cask "mimestream"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Data science software focusing on R and Python
cask "rstudio"
# Quicklook extension for source files
cask "syntax-highlight"
# Open-source code editor
cask "visual-studio-code"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
