alt-tab
appcleaner
brave-browser
dozer
font-hack-nerd-font
font-jetbrains-mono
font-juliamono
google-drive
iterm2
julia
karabiner-elements
logseq
macdown
miniconda
onedrive
onyx
pgadmin4
raycast
rectangle
rstudio
slack
the-unarchiver
tomighty
twobird
visual-studio-code
xquartz
zotero
