alt-tab
appcleaner
brave-browser
discord
dozer
font-dejavu-sans-mono-nerd-font
font-fira-sans
font-hack-nerd-font
font-jetbrains-mono
font-juliamono
font-lato
font-montserrat
font-open-sans
font-poppins
font-raleway
font-roboto-mono
font-yanone-kaffeesatz
google-drive
iterm2
jetbrains-toolbox
julia
karabiner-elements
logseq
macdown
onedrive
onyx
pgadmin4
raycast
rectangle
rstudio
slack
the-unarchiver
visual-studio-code
xquartz
zoom
zotero
